{{- if eq chezmoi.os "darwin" }}
###
# GNU
###

# GNU programs non-existing in macOS
brew "autoconf"
brew "tree"
brew "watch"
brew "wdiff"
brew "wget"

# GNU programs whose BSD counterpart is installed in macOS
brew "coreutils"
brew "binutils"
brew "diffutils"
brew "ed"
brew "findutils"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "gzip"
brew "screen"

# GNU programs existing in macOS which are outdated
brew "bash"
brew "bison"
brew "emacs"
brew "gpatch"
brew "less"
brew "m4"
brew "make"
brew "nano"

# BSD programs existing in macOS which are outdated
brew "flex"

###
# cli utilities
###

# shell
brew "btop"
brew "mcfly"
brew "mcfly-fzf"
brew "pay-respects"
brew "procs"
brew "tlrc"

# text
brew "bat"
brew "jq"
brew "ripgrep"
brew "yq"

# files
brew "dtrx"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "yazi"
brew "zoxide"

# security
brew "gnupg"
brew "openssh"

# data transfer
brew "curl"
brew "httpie"
brew "rclone"
brew "rsync"

# git
brew "git-delta"
brew "git-extras"
brew "git-lfs"

###
# misc
###

# Terminals & Editors
brew "helix"
brew "tmux"
brew "zsh"

# Dev tools
brew "ansible"
brew "bun"
brew "deno"
brew "direnv"
brew "git"
brew "gh"
brew "glab"
brew "mise"
brew "ollama"
brew "pnpm"
brew "rustup"
brew "terraform"
brew "terragrunt"
brew "unison"
brew "yarn"

# Container
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "kubectl"

# Work / Cloud
brew "awscli"
brew "azure-cli"
brew "databricks-cli"
brew "libomp"

# macOS Apps
cask "adguard"
cask "brave-browser"
cask "cloudflare-warp"
cask "firefox"
cask "github"
cask "intune-company-portal"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
{{- end }}
